In [1]:
import pandas as pd

In [3]:
growth = pd.Series([143,150,157,160], index = ["2018","2019","2020","2021"])
growth

2018    143
2019    150
2020    157
2021    160
dtype: int64

In [5]:
growth["2018"]

143

In [7]:
index = ['2018','2019','2020','2021']

Yeonghee = pd.Series([143,150,157,160], index=index)
Cheolsu = pd.Series([165,172,175,180], index=index)

growth = pd.DataFrame({
    '영희' : Yeonghee,
    '철수' : Cheolsu
})

growth

       영희   철수
2018  143  165
2019  150  172
2020  157  175
2021  160  180

In [8]:
index = ['2018','2019','2020','2021']

data = {
    '영희' : [143,150,157,160],
    '철수' : [165,172,175,180]
}

growth = pd.DataFrame(data, columns=['영희','철수'], index=index)

growth

       영희   철수
2018  143  165
2019  150  172
2020  157  175
2021  160  180

In [9]:
print(growth.dtypes)

growth.astype('float')

영희    int64
철수    int64
dtype: object

         영희     철수
2018  143.0  165.0
2019  150.0  172.0
2020  157.0  175.0
2021  160.0  180.0

In [10]:
growth.astype({'영희':'float'})

         영희   철수
2018  143.0  165
2019  150.0  172
2020  157.0  175
2021  160.0  180

In [14]:
pd.read_csv("ABC.csv")

   A  B  C
0  1  2  3
1  4  5  6

In [16]:
pd.read_csv("ABC.csv", index_col=0)

     A  B  C
0    1  2  3
100  4  5  6

In [17]:
print(growth)

       영희   철수
2018  143  165
2019  150  172
2020  157  175
2021  160  180

In [18]:
growth.to_csv("output.csv", index=False)

In [19]:
growth["영희"]

2018    143
2019    150
2020    157
2021    160
Name: 영희, dtype: int64

In [22]:
growth.영희[1:]

2019    150
2020    157
2021    160
Name: 영희, dtype: int64

In [23]:
growth.iloc[0]

영희    143
철수    165
Name: 2018, dtype: int64

In [26]:
growth.iloc[-2:,-2:]

       영희   철수
2020  157  175
2021  160  180

In [27]:
growth.set_index("영희")

      철수
영희
143  165
150  172
157  175
160  180

In [28]:
growth.loc[growth.영희>150]

       영희   철수
2020  157  175
2021  160  180

In [29]:
growth.영희>150

2018    False
2019    False
2020     True
2021     True
Name: 영희, dtype: bool

In [31]:
index = ["영희","철수","영철"]
data = {
    "2018":[145,165,170],
    "2019":[165,172,175],
    "2020":[170,175,177]
}

growth = pd.DataFrame(data,index=index)
growth

    2018  2019  2020
영희   145   165   170
철수   165   172   175
영철   170   175   177

In [32]:
growth["2019"]=190
print(growth)

    2018  2019  2020
영희   145   190   170
철수   165   190   175
영철   170   190   177

In [34]:
growth["2021"]=200
print(growth)

    2018  2019  2020  2021
영희   145   190   170   200
철수   165   190   175   200
영철   170   190   177   200

In [35]:
growth["거꾸로"]=range(len(growth),0,-1)
print(growth)

    2018  2019  2020  2021  거꾸로
영희   145   190   170   200    3
철수   165   190   175   200    2
영철   170   190   177   200    1